Task/src/DataProcessors/ПодборЗадач/ПодборЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодборЗадач</name>
</mdclass:DataProcessor>

Task/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Task/src/DataProcessors/ПодборЗадач/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Партнер") Тогда
		Партнер = Параметры.Партнер;
	КонецЕсли;
	
	Если Параметры.Свойство("Сумма") Тогда
		Сумма = Параметры.Сумма;
	КонецЕсли;
	
	ЗаполнитьДанными();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПараметрыЗапДок = Новый Массив;
	
	Для Каждого Стр Из СписокЗадачи Цикл
		Если Стр.Выбор Тогда
			Струк = Новый Структура;
			Струк.Вставить("Объект",Стр.Задача);
			Струк.Вставить("Сумма",Стр.Сумма);
			ПараметрыЗапДок.Добавить(Струк);
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(ПараметрыЗапДок);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанными()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.Объект КАК Задача,
	|	ВзаиморасчетыОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(, Партнер = &партнер) КАК ВзаиморасчетыОстатки");
	Запрос.УстановитьПараметр("Партнер",Партнер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Нстр = СписокЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(Нстр,Выборка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачиПриИзменении(Элемент)
	ПодобраноНаСумму = 0;
	Для Каждого Стр Из СписокЗадачи Цикл
		Если Стр.Выбор Тогда
			ПодобраноНаСумму = ПодобраноНаСумму + Стр.Сумма;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ЗаполнитьДанными();
КонецПроцедуры
